//
// Created by Гладышев ВВ on 27.02.2022.
// ООП на примере C++
// ДЗ к уроку 7 Потоки ввода-вывода
//

#include <iostream>

using namespace std;

//Класс Дата
class Data
{
public:
    //Коструктор
    Data();

private:

};



int main()
{
    setlocale(LC_ALL, "Russian");

// Задание 1
    cout << "Задание 1" << endl;

    cout << endl;
// Задание 2
    cout << "Задание 2" << endl;

    cout << endl;
}
